#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_password.database_password: Refreshing state... [id=none]
google_project_service.sql: Refreshing state... [id=venture-capitol/sqladmin.googleapis.com]
google_project_service.run: Refreshing state... [id=venture-capitol/run.googleapis.com]
google_project_service.iam: Refreshing state... [id=venture-capitol/iam.googleapis.com]
google_project_service.secretmanager: Refreshing state... [id=venture-capitol/secretmanager.googleapis.com]
google_secret_manager_secret.db_connection_string: Refreshing state... [id=projects/venture-capitol/secrets/db_connection_string]
google_service_account.backend_sa: Refreshing state... [id=projects/venture-capitol/serviceAccounts/backend-sa@venture-capitol.iam.gserviceaccount.com]
google_sql_database_instance.vc_db: Refreshing state... [id=vc-backend-database]
google_project_iam_binding.service_permissions["run.admin"]: Refreshing state... [id=venture-capitol/roles/run.admin]
google_project_iam_binding.service_permissions["cloudsql.client"]: Refreshing state... [id=venture-capitol/roles/cloudsql.client]
google_secret_manager_secret_iam_binding.db_connection_string_access: Refreshing state... [id=projects/venture-capitol/secrets/db_connection_string/roles/secretmanager.secretAccessor]
google_sql_user.database_user: Refreshing state... [id=backend_user//vc-backend-database]
google_sql_database.backend_database: Refreshing state... [id=projects/venture-capitol/instances/vc-backend-database/databases/backend]
google_secret_manager_secret_version.db_connection_string_data: Refreshing state... [id=projects/122736358705/secrets/db_connection_string/versions/1]
google_cloud_run_service.backend: Refreshing state... [id=locations/europe-west1/namespaces/venture-capitol/services/vc-backend]
google_cloud_run_service_iam_policy.noauth: Refreshing state... [id=v1/projects/venture-capitol/locations/europe-west1/services/vc-backend]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # google_cloud_run_service.backend has changed
  ~ resource "google_cloud_run_service" "backend" {
        id                         = "locations/europe-west1/namespaces/venture-capitol/services/vc-backend"
        name                       = "vc-backend"
      ~ status                     = [
          ~ {
              ~ latest_created_revision_name = "vc-backend-lh6vg" -> "vc-backend-00003-wez"
              ~ latest_ready_revision_name   = "vc-backend-lh6vg" -> "vc-backend-00003-wez"
              ~ observed_generation          = 2 -> 5
                # (2 unchanged elements hidden)
            },
        ]
        # (3 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              + "client.knative.dev/user-image"     = "europe-west1-docker.pkg.dev/venture-capitol/images/backend:0f5c6c"
              + "run.googleapis.com/client-name"    = "cloud-console"
              ~ "serving.knative.dev/lastModifier"  = "vc-cicd@venture-capitol.iam.gserviceaccount.com" -> "skyguardian42@gmail.com"
                # (3 unchanged elements hidden)
            }
          ~ generation       = 2 -> 5
          ~ resource_version = "AAXS9jn8fOM" -> "AAXTC7eryls"
            # (4 unchanged attributes hidden)
        }

      ~ template {
          ~ metadata {
              ~ annotations = {
                  + "client.knative.dev/user-image"         = "europe-west1-docker.pkg.dev/venture-capitol/images/backend:0f5c6c"
                  ~ "run.googleapis.com/client-name"        = "terraform" -> "gcloud"
                  + "run.googleapis.com/client-version"     = "365.0.1"
                    # (2 unchanged elements hidden)
                }
              + name        = "vc-backend-00003-wez"
                # (2 unchanged attributes hidden)
            }

          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "europe-west1-docker.pkg.dev/venture-capitol/images/backend:aa042b" -> "europe-west1-docker.pkg.dev/venture-capitol/images/backend:0f5c6c"
                    # (2 unchanged attributes hidden)



                    # (3 unchanged blocks hidden)
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # google_project_iam_binding.service_permissions["cloudsql.client"] has changed
  ~ resource "google_project_iam_binding" "service_permissions" {
      ~ etag    = "BwXSCd3u864=" -> "BwXS+9cD+IE="
        id      = "venture-capitol/roles/cloudsql.client"
        # (3 unchanged attributes hidden)
    }

  # google_project_iam_binding.service_permissions["run.admin"] has changed
  ~ resource "google_project_iam_binding" "service_permissions" {
      ~ etag    = "BwXSCd3u864=" -> "BwXS+9cD+IE="
        id      = "venture-capitol/roles/run.admin"
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_cloud_run_service.backend will be updated in-place
  ~ resource "google_cloud_run_service" "backend" {
        id                         = "locations/europe-west1/namespaces/venture-capitol/services/vc-backend"
        name                       = "vc-backend"
        # (4 unchanged attributes hidden)


      ~ template {
          ~ metadata {
              ~ annotations = {
                  - "client.knative.dev/user-image"         = "europe-west1-docker.pkg.dev/venture-capitol/images/backend:0f5c6c" -> null
                  ~ "run.googleapis.com/client-name"        = "gcloud" -> "terraform"
                  - "run.googleapis.com/client-version"     = "365.0.1" -> null
                    # (2 unchanged elements hidden)
                }
                name        = "vc-backend-00003-wez"
                # (2 unchanged attributes hidden)
            }

          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "europe-west1-docker.pkg.dev/venture-capitol/images/backend:0f5c6c" -> "europe-west1-docker.pkg.dev/venture-capitol/images/backend:d4fe46"
                    # (2 unchanged attributes hidden)



                    # (3 unchanged blocks hidden)
                }
            }
        }

        # (2 unchanged blocks hidden)
    }

  # google_cloud_run_service.staging_backend will be created
  + resource "google_cloud_run_service" "staging_backend" {
      + autogenerate_revision_name = true
      + id                         = (known after apply)
      + location                   = "europe-west1"
      + name                       = "vc-backend-staging"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = {
                  + "autoscaling.knative.dev/maxScale"      = "10"
                  + "run.googleapis.com/client-name"        = "terraform"
                  + "run.googleapis.com/cloudsql-instances" = "venture-capitol:europe-west1:vc-backend-database"
                }
              + generation       = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = "backend-sa@venture-capitol.iam.gserviceaccount.com"
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "europe-west1-docker.pkg.dev/venture-capitol/images/backend:d4fe46"

                  + env {
                      + name = "DATABASE_URL"

                      + value_from {
                          + secret_key_ref {
                              + key  = "1"
                              + name = "staging_db_connection_string"
                            }
                        }
                    }

                  + ports {
                      + container_port = (known after apply)
                      + name           = (known after apply)
                      + protocol       = (known after apply)
                    }

                  + resources {
                      + limits   = (known after apply)
                      + requests = (known after apply)
                    }
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
        }
    }

  # google_secret_manager_secret.staging_db_connection_string will be created
  + resource "google_secret_manager_secret" "staging_db_connection_string" {
      + create_time = (known after apply)
      + expire_time = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + secret_id   = "staging_db_connection_string"

      + replication {
          + automatic = true
        }
    }

  # google_secret_manager_secret_version.staging_db_connection_string will be created
  + resource "google_secret_manager_secret_version" "staging_db_connection_string" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = true
      + id           = (known after apply)
      + name         = (known after apply)
      + secret       = (known after apply)
      + secret_data  = (sensitive value)
    }

  # google_sql_database.staging_backend_database will be created
  + resource "google_sql_database" "staging_backend_database" {
      + charset   = (known after apply)
      + collation = (known after apply)
      + id        = (known after apply)
      + instance  = "vc-backend-database"
      + name      = "staging_backend"
      + project   = (known after apply)
      + self_link = (known after apply)
    }

  # google_sql_user.staging_database_user will be created
  + resource "google_sql_user" "staging_database_user" {
      + host     = (known after apply)
      + id       = (known after apply)
      + instance = "vc-backend-database"
      + name     = "staging_backend_user"
      + password = (sensitive value)
      + project  = (known after apply)
    }

  # random_password.staging_db_password will be created
  + resource "random_password" "staging_db_password" {
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

Plan: 6 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>